{"intents":[
    {
        "tag": "saludo",
        "patterns": ["hola", "Hola", "hola", "qué tal", "cómo estás", "buenos días", "buenas tardes", "buenas noches", "qué onda", "cómo va todo", "qué hay", "cómo andamos", "qué pasa", "buen día", "cómo estás hoy", "hey", "qué sucede", "qué se cuenta", "qué me cuentas", "hola amigo", "buenas, ¿cómo estamos?", "hola, buen día", "saludos cordiales", "hola, ¿todo bien?", "cómo te ha ido", "hola, ¿algo nuevo?", "hola, ¿cómo va todo?", "qué hay de nuevo", "hola, ¿qué me cuentas?", "buenas, ¿qué hay?", "hola, ¿cómo va la vida?", "buenas vibras", "hola, ¿alguna novedad?", "hey, ¿cómo va tu día?", "hola, ¿todo en orden?", "buenas, ¿qué hay de nuevo?"],
        "responses": ["¡Hola! ¿Cómo puedo ayudarte?", "Es un gusto saludarte, ¿como puedo apoyarte?", "¡Hola! Estoy aquí para ayudarte, ¿qué necesitas?", "Hola, ¿en qué puedo asistirte hoy?", "Saludos, dime en qué puedo ser útil", "¡Buen día! Aquí para servirte, ¿qué se te ofrece?", "Hola, un placer ayudarte, ¿cómo puedo hacer tu día mejor?", "¡Hola! Aquí estoy para lo que necesites, ¿cuál es tu consulta?", "Hola, listo para asistirte, ¿cuál es tu pregunta?", "Saludos, aquí para apoyarte, dime ¿cómo puedo ayudarte?", "¡Hola! ¿Hay algo específico con lo que te pueda ayudar hoy?", "Hola, listo para responder tus dudas, ¿qué deseas saber?"]
    },
    {
        "tag": "nombre",
        "patterns": ["cómo es tu nombre", "cómo te llamas", "¿nombre?", "¿te llamas?", "¿cómo te dicen?", "dime tu nombre", "quién eres", "tu nombre, por favor", "con quién hablo", "identifícate", "quién es el asistente", "cómo debo llamarte", "eres el bot de Atrato, ¿verdad?", "tu alias, por favor", "quién me ayuda", "dime cómo te llamas", "tu identificación", "necesito saber tu nombre", "cómo te identificas", "quién está ahí", "con quién estoy hablando", "quién me atiende", "cómo es que te llamas", "eres el asistente, ¿cierto?", "nombre del asistente, por favor"],
        "responses": ["Soy el asistente virtual inteligente de Atrato, estoy aquí para ayudarte.", "Soy el nuevo asistente virtual de Atrato, ¿cómo puedo ayudarte?", "Me conocen como el asistente Atrato, a tu servicio", "Soy el bot de Atrato, ¿en qué puedo ayudarte?", "Me puedes llamar Asistente Atrato, ¿qué necesitas?", "Soy el asistente virtual de Atrato, aquí para ayudarte", "Me llamo Asistente Atrato, listo para asistirte en lo que necesites", "Soy el bot creado por Atrato para tu servicio, dime tu consulta", "Puedes referirte a mí como el Asistente Atrato, ¿cuál es tu pregunta?", "Soy el asistente de Atrato, disponible para responder tus preguntas", "Soy tu asistente virtual de Atrato, ¿cómo puedo ser de ayuda hoy?", "Como asistente de Atrato, estoy aquí para ofrecerte la mejor ayuda posible, dime tu duda"]
    },
    {
        "tag": "atratoPago",
        "patterns": ["¿Qué es Atrato?", "¿Qué es Atrato Pago?", "Atrato Pago", "¿Cómo funciona AtratoPago?", "¿Cómo se utiliza Atrato Pago?", "¿Cómo funciona este servicio?", "¿Cómo funciona?", "información sobre Atrato Pago", "qué servicios ofrece Atrato Pago", "qué es lo que hace Atrato Pago", "funcionamiento de Atrato Pago", "explicación de Atrato Pago", "características de Atrato Pago", "qué puedo hacer con Atrato Pago", "beneficios de usar Atrato Pago", "cómo me beneficia Atrato Pago", "qué ventajas tiene Atrato Pago", "cómo operar con Atrato Pago", "instrucciones para Atrato Pago", "guía de Atrato Pago", "dime más sobre Atrato Pago", "cómo se usa Atrato Pago", "proceso de Atrato Pago", "quiero entender AtratoPago", "ayuda con Atrato Pago", "cómo puedo comprar con Atrato Pago", "explica el servicio de Atrato Pago", "pasos para usar Atrato Pago", "descripción de Atrato Pago", "utilizar Atrato Pago", "quiero usar Atrato Pago", "cómo hago pagos con Atrato", "funciones de Atrato Pago", "pagar con Atrato Pago", "comprar ahora y pagar después", "financiamiento con Atrato", "crédito de Atrato Pago", "Atrato Pago beneficios", "Atrato Pago comercios afiliados", "Atrato Pago en línea", "cómo acceder a Atrato Pago", "método de pago Atrato", "Atrato Pago cuotas", "financiar compra con Atrato", "compras a plazos Atrato", "Atrato Pago sin tarjeta", "Atrato Pago sin banco", "Atrato, explica tu servicio", "Atrato Pago y ecommerce", "detalles del servicio Atrato Pago"],
        "responses": ["Atrato Pago es un método de pago que te permite realizar compras en comercios afiliados, ya sea de manera online o física, con montos que llegan hasta los 200,00 MXN, con oportunidad de pagarlas hasta en 24 meses.", "Atrato Pago te facilita pagar tus compras en cuotas, sin tarjeta de crédito. ¿Te interesa saber cómo empezar?", "Con Atrato Pago, eliges cómo financiar tus compras en comercios afiliados. ¿Quieres detalles sobre los pasos a seguir?", "Atrato Pago es tu solución para pagar a plazos en más de 1,000 comercios. ¿Necesitas ayuda con el proceso?", "Es simple: con Atrato Pago compras hoy y pagas con flexibilidad. ¿Hay algo específico que necesitas?", "Atrato Pago es ideal para financiar tus compras sin complicaciones. ¿Te gustaría conocer más beneficios?", "Usar Atrato Pago es sencillo y rápido. Puedo guiarte en cómo hacer tu primera compra. ¿Te parece?", "Atrato Pago transforma la manera de pagar. Compra ahora, paga después, incluso sin crédito bancario. ¿Te explico más?", "Nuestro servicio Atrato Pago ofrece comprar en comercios afiliados y pagar poco a poco. ¿Deseas más información?", "Atrato Pago te da libertad y flexibilidad para manejar tus finanzas. ¿Quieres saber cómo aplicar?", "Con Atrato Pago, obtienes financiamiento instantáneo para tus compras. ¿Te gustaría aprender cómo funciona?"]
    },
    {
        "tag": "hablarConHumano",
        "patterns": ["Quiero hablar con una persona", 
        "Quiero hablar con un empleado", 
        "Quiero hablar con alguien más", 
        "¿Puedes redirigirme con un empleado?", 
        "¿Puedes darme detalles de mi crédito?",
        "¿Puedes darme el saldo de mi cuenta?"],
        "responses": ["Puedes comunicarte directamente con nuestros empleados a través de WhatsApp al número 523316024360."]
    },
    {
        "tag": "FAQsFinanciamiento",
        "patterns": [
          "¿Cuál es la tasa de interés de Atrato Pago?",
          "¿Cuánto tiempo tengo para pagar?",
          "¿Puedo pagar mi compra antes de la fecha límite?",
          "¿Qué ocurre si me retraso en un pago?",
          "¿Cómo se calcula el interés en Atrato Pago?",
          "¿Atrato Pago ofrece planes sin interés?",
          "¿Hay un monto máximo de financiamiento?",
          "¿Qué pasa si cancelo una compra financiada?",
          "¿Puedo aumentar mi límite de crédito con Atrato?",
          "¿Atrato verifica mi historial crediticio?",
          "¿Se pueden realizar pagos extra para disminuir el interés?",
          "¿Qué requisitos necesito para calificar para Atrato Pago?",
          "¿Hay costos ocultos en el financiamiento?",
          "¿Atrato Pago está disponible para todos los productos?",
          "¿Cómo afecta el financiamiento de Atrato a mi puntuación crediticia?",
          "¿Qué documentos necesito para aplicar a Atrato Pago?",
          "¿Puedo usar Atrato Pago para compras en línea?",
          "¿Cómo puedo consultar los términos y condiciones?",
          "¿El financiamiento aplica para servicios o solo productos?",
          "¿Puedo financiar compras en cualquier comercio?",
          "¿Existe un período de gracia para los pagos atrasados?",
          "¿Cómo se aplican los pagos a mi balance?",
          "¿Puedo financiar múltiples compras a la vez?",
          "¿Qué tipo de interés aplica, fijo o variable?",
          "¿Hay una penalización por cancelación del financiamiento?",
          "¿Cómo puedo saber el estado de mi cuenta?",
          "¿Qué sucede si devuelvo un producto financiado?",
          "¿Puedo cambiar el plan de financiamiento una vez seleccionado?",
          "¿Hay un mínimo de compra para utilizar Atrato Pago?",
          "¿Cómo puedo hacer un seguimiento de mis pagos?"
        ],
        "responses": [
          "La tasa de interés varía según el comercio y el plan seleccionado. Para más detalles, revisa los términos al momento de tu compra.",
          "Puedes financiar tus compras hasta en 24 meses, dependiendo del plan que elijas.",
          "Sí, puedes realizar pagos adelantados sin penalización, lo que puede reducir el interés total.",
          "Los pagos tardíos pueden incurrir en cargos adicionales. Es importante mantenerse al día para evitar costos extras.",
          "El interés se calcula en base al monto de la compra y el plan de financiamiento seleccionado.",
          "Algunos comercios ofrecen planes sin interés con Atrato Pago. Estos varían y están sujetos a términos y condiciones.",
          "El monto máximo de financiamiento depende de tu historial con Atrato y los detalles específicos del comercio.",
          "Si cancelas una compra financiada, el monto restante se ajustará según los términos de tu acuerdo con Atrato.",
          "Tu límite de crédito con Atrato puede aumentar basado en tu historial de pagos y uso del servicio."
        ]
      },
      {
        "tag": "AtratoCash",
        "patterns": [
          "¿Qué es AtratoCash?",
          "Cómo puedo acceder a AtratoCash",
          "Requisitos para AtratoCash",
          "Quiero solicitar AtratoCash",
          "Dudas sobre AtratoCash",
          "¿Cómo funciona AtratoCash?",
          "Obtener crédito con Atrato",
          "Préstamos personales de Atrato",
          "Condiciones para crédito AtratoCash",
          "Límite de préstamo AtratoCash",
          "Pago de préstamos AtratoCash",
          "¿AtratoCash es inmediato?",
          "Tasas de interés AtratoCash",
          "¿Puedo pagar AtratoCash anticipadamente?",
          "Renovación de crédito con AtratoCash",
          "Monto máximo de AtratoCash",
          "Simulador de crédito AtratoCash",
          "¿AtratoCash revisa el Buró de Crédito?",
          "Proceso de aprobación de AtratoCash",
          "Plazos de pago en AtratoCash",
          "¿AtratoCash para qué tipo de gastos?",
          "¿Hay penalizaciones por atraso en AtratoCash?",
          "¿Cómo veo mi saldo de AtratoCash?",
          "Elegibilidad para AtratoCash",
          "¿AtratoCash ofrece refinanciamiento?",
          "Beneficios de AtratoCash",
          "Crédito AtratoCash para emergencias",
          "¿Cómo abono a mi crédito AtratoCash?",
          "¿AtratoCash tiene promociones?",
          "Ventajas de AtratoCash sobre tarjetas de crédito"
        ],
        "responses": [
          "AtratoCash es un crédito personal que puedes solicitar después de haber pagado una parte de tu primer préstamo con nosotros. Es un proceso sencillo que te permite recibir hasta 200,000 MXN directamente en tu cuenta bancaria.",
          "Para acceder a AtratoCash, solo necesitas ser un cliente de Atrato y seguir unos sencillos pasos en nuestra plataforma.",
          "Si cumples con los pagos de tu préstamo actual, puedes solicitar AtratoCash con tan solo unos clics a través de nuestra app o sitio web."
        ]
      },      
      {
        "tag": "ComerciosAfiliados",
        "patterns": [
          "¿Dónde puedo usar Atrato Pago?",
          "¿Qué tiendas aceptan Atrato?",
          "Lista de comercios con Atrato",
          "¿En cuáles comercios está disponible Atrato?",
          "¿Atrato tiene alianzas con tiendas de electrónicos?",
          "¿Puedo usar Atrato en tiendas de ropa?",
          "¿Cuáles son los comercios afiliados a Atrato?",
          "¿Atrato es aceptado en tiendas en línea?",
          "¿Hay supermercados que acepten Atrato Pago?",
          "¿Atrato funciona en tiendas de muebles?",
          "¿Qué restaurantes tienen convenio con Atrato?",
          "¿Atrato Pago se puede usar en farmacias?",
          "¿Hay algún directorio de comercios con Atrato?",
          "¿Cómo sé si una tienda acepta Atrato Pago?",
          "¿Atrato colabora con tiendas de deportes?",
          "¿Puedo comprar tecnología con Atrato Pago?",
          "¿Qué servicios puedo pagar con Atrato?",
          "¿Atrato Pago es válido en tiendas de mascotas?",
          "¿Cómo encuentro tiendas afiliadas a Atrato cerca de mí?",
          "¿Atrato tiene acuerdos con tiendas de hobbies?",
          "¿Se puede usar Atrato en librerías?",
          "¿Puedo utilizar Atrato para servicios en línea?",
          "¿Qué categorías de comercios aceptan Atrato?",
          "¿Cómo agregar mi comercio a la red de Atrato?",
          "¿Atrato está disponible en tiendas de regalos?",
          "¿Puedo usar Atrato en servicios de entretenimiento?",
          "¿Atrato es aceptado en plataformas de streaming?",
          "¿Cuáles son los nuevos comercios afiliados a Atrato?",
          "¿Atrato Pago se puede usar para servicios educativos?",
          "¿Atrato tiene alianzas con agencias de viajes?"
        ],
        "responses": [
          "Puedes utilizar Atrato Pago en una amplia gama de comercios afiliados, desde tiendas en línea hasta establecimientos físicos, en categorías como electrónica: Inmeza, CSL Plaza Tecnología, Contino, AO Store, Ignite Store, Ok Dock, Game Zone. Ciclismo: Giant, Liv, Scott, Specialized, Raudor, Momentum Bikes, Worqout, El Salón de la Bicicleta, Trek, People For Bikes, Veloci, Belfort Bikes, Sunpeed, Chelini Bikes, Chop Chop Bikes, Mercado Bici, Creek Cave, We R Bikes, Turbo Bicycles, Bike Store, Zona Bici, La Bici Urbana, Samao, Import Bike, Ready 4 Action, Eddys Bikes, The Bike Factory, Ciclometa, Bicivik, The Zone MX. Dental: Dentalia, Invisalign, Moons, Centauro, Dentalstar. Construcción: Santandreu, Ceramat, Abastecedora, Dihsa, Todo para tu casa. Hogar: Mathasa, Mueblería Standard, Sofamex, Mueblería Olivas, TuGow, Nu Espacios, Blue Room, Novo Muebles, Mueblería Brasil, Mueblerías Central, Foly Muebles, Ryse, Makora, Álamo Muebles, Maha Home. Música: Hermes Music Club, Faly Music, Greins Casa de Música, Guitar Gear, JD Luthier, Ani Music, Mr. CD, Drum Station, JP Musical. Sleep: Smart Bamboo, Atlas del Descanso, Colchonera San Luis, Don Colchón, Drim Sleep. Motocicletas: Mondo di moto, Bajaj, Atrum, Motometa, Moto Diez, TP motosports. Movilidad: Mandarina.bike, Andafacil. Otros: Arome México, Local Adventures, Mappa, Names, Owl Classic Cymbals, Kama Beauty, Grupo Alfa, Reyfri, El Lugar del Chef. Y más.",
          "Visita nuestro sitio web para ver la lista actualizada de comercios donde Atrato Pago es aceptado, incluyendo tiendas de electrónicos, ropa, supermercados, y restaurantes.",
          "Nuestro directorio de comercios afiliados está disponible en nuestra página web. Aquí encontrarás desde tiendas de deportes hasta servicios en línea que aceptan Atrato Pago."
        ]
      },
      {
        "tag": "ProcesoAplicación",
        "patterns": [
          "¿Cómo aplico para Atrato Pago?",
          "Pasos para registrarse en Atrato",
          "Proceso de solicitud para Atrato",
          "¿Qué necesito para aplicar a Atrato Pago?",
          "Guía para aplicar a Atrato Pago",
          "Requisitos para usar Atrato",
          "Documentación para Atrato Pago",
          "¿Cómo empezar con Atrato Pago?",
          "¿Atrato requiere verificación de crédito?",
          "Formulario de aplicación Atrato",
          "¿Cuánto tarda el proceso de aprobación?",
          "¿Puedo aplicar a Atrato con mal crédito?",
          "Edad mínima para Atrato Pago",
          "Aplicar a Atrato como extranjero",
          "¿Atrato verifica ingresos?",
          "¿Necesito cuenta bancaria para Atrato?",
          "Límite de crédito inicial en Atrato",
          "Renovar solicitud Atrato Pago",
          "Actualizar datos en aplicación Atrato",
          "Cancelar aplicación a Atrato Pago",
          "Rechazo de solicitud Atrato, ¿qué hacer?",
          "¿Atrato tiene atención al cliente para aplicaciones?",
          "¿Atrato Pago está disponible para estudiantes?",
          "Aplicación en línea vs en tienda para Atrato",
          "¿Se puede usar Atrato sin historial crediticio?",
          "Beneficios de aplicar a Atrato Pago",
          "¿Atrato Pago ofrece planes para freelancers?",
          "¿Cómo afecta aplicar a Atrato mi score crediticio?",
          "Aplicar a Atrato siendo desempleado, ¿es posible?",
          "¿Atrato permite co-aplicantes o avales?"
        ],
        "responses": [
          "Aplicar para Atrato Pago es sencillo: solo necesitas tu identificación oficial, comprobante de domicilio, y completar el formulario en nuestro sitio. La aprobación puede ser inmediata según tu perfil.",
          "Para registrarte en Atrato, visita nuestra web, llena el formulario de aplicación y espera la verificación. Nuestro equipo te guiará en cada paso.",
          "Los requisitos para Atrato Pago incluyen ser mayor de edad, residir en México, y tener un ingreso estable. No es necesario tener un historial crediticio perfecto."
        ]
      },
      {
        "tag": "GestiónCuenta",
        "patterns": [
          "¿Cómo puedo acceder a mi cuenta?",
          "Necesito cambiar mi contraseña",
          "¿Dónde actualizo mis datos personales?",
          "¿Cómo reviso mi saldo actual?",
          "Quiero ver mi historial de pagos",
          "¿Cómo agrego una nueva tarjeta de pago?",
          "Necesito ayuda para iniciar sesión",
          "¿Cómo cierro sesión en todos mis dispositivos?",
          "¿Puedo cambiar mi correo electrónico registrado?",
          "¿Cómo activo notificaciones para mi cuenta?",
          "Quiero desactivar mi cuenta temporalmente",
          "¿Cómo reactivo mi cuenta de Atrato?",
          "¿Qué hago si mi cuenta está bloqueada?",
          "¿Cómo reporto actividad sospechosa en mi cuenta?",
          "Quiero configurar alertas de pago",
          "¿Cómo puedo consultar mi límite de crédito?",
          "¿Dónde encuentro los términos y condiciones de servicio?",
          "¿Cómo actualizo mi información bancaria?",
          "¿Puedo configurar un pago automático?",
          "¿Cómo cancelo un pago automático?",
          "¿Dónde veo mis facturas pendientes?",
          "¿Cómo solicito un aumento de mi línea de crédito?",
          "Necesito una copia de mi contrato",
          "¿Cómo descargo mi estado de cuenta?",
          "¿Dónde puedo dejar una sugerencia o comentario?",
          "¿Cómo me comunico con soporte al cliente?",
          "¿Puedo cambiar la fecha de pago?",
          "¿Cómo veo las promociones actuales?",
          "¿Dónde puedo reportar un error en la facturación?",
          "Necesito asesoría sobre mi cuenta"
        ],
        "responses": [
          "Puedes acceder a tu cuenta desde nuestra página web o app, usando tu correo y contraseña.",
          "Para cambiar tu contraseña o actualizar tus datos, ve a la sección de configuración de tu cuenta en nuestra plataforma.",
          "Tu saldo y historial de pagos se pueden revisar fácilmente en la sección 'Mi cuenta' de nuestra app o sitio web.",
          "Si necesitas cambiar tu información de pago o tienes problemas para iniciar sesión, nuestro soporte al cliente está aquí para ayudarte.",
          "Para cualquier gestión de tu cuenta, como configuración de alertas, aumento de límite de crédito o consultas sobre facturación, por favor visita la sección de ayuda en nuestro sitio web."
        ]
      },
      {
        "tag": "OfertasPromociones",
        "patterns": [
          "¿Cuáles son las ofertas actuales?",
          "¿Dónde encuentro las últimas promociones?",
          "Promociones disponibles con Atrato Pago",
          "¿Cómo accedo a ofertas exclusivas?",
          "¿Atrato tiene descuentos especiales?",
          "¿Hay promociones para nuevos usuarios?",
          "¿Cómo me entero de las próximas ofertas?",
          "¿Atrato ofrece cupones de descuento?",
          "Promociones de temporada con Atrato",
          "Ofertas especiales de fin de año",
          "¿Hay rebajas en comercios específicos?",
          "¿Cómo puedo aprovechar las ofertas de Atrato?",
          "¿Existen códigos promocionales de Atrato?",
          "¿Dónde puedo encontrar ofertas de último minuto?",
          "¿Atrato tiene promociones para el Buen Fin?",
          "Ofertas de Black Friday disponibles",
          "Promociones de Cyber Monday con Atrato",
          "¿Cómo participo en sorteos de Atrato?",
          "¿Hay descuentos por referir amigos?",
          "Beneficios exclusivos para usuarios frecuentes",
          "¿Atrato realiza ofertas en días festivos?",
          "¿Cómo canjeo una promoción de Atrato?",
          "Descuentos en aniversario de comercios afiliados",
          "Ofertas para días especiales",
          "Promociones exclusivas para miembros",
          "¿Atrato ofrece financiamiento promocional?",
          "¿Cómo me suscribo a alertas de ofertas?",
          "¿Atrato tiene colaboraciones con marcas para ofertas?",
          "¿Dónde veo las promociones vigentes?",
          "¿Atrato tiene convenios con bancos para promociones?"
        ],
        "responses": [
          "Las ofertas y promociones actuales se pueden encontrar en nuestro sitio web y redes sociales. Mantente atento a las actualizaciones para aprovecharlas.",
          "Accede a ofertas exclusivas y descuentos especiales registrándote en nuestro boletín y siguiéndonos en redes sociales. ¡No te pierdas las promociones para nuevos usuarios!",
          "Para participar en sorteos y aprovechar descuentos por referir amigos, asegúrate de estar inscrito en nuestra plataforma y verifica regularmente las novedades en tu cuenta."
        ]
      }
      
]

}